let courseName;

for (let i = 0; i < document.querySelectorAll('.item').length; i++) {
	document.querySelectorAll('.item')[i].addEventListener('click', () => {
		courseName = document.querySelectorAll('.item')[i].getAttribute('data-value')
		for (let j = 0; j < document.querySelectorAll('.item').length; j++) {
			document.querySelectorAll('.item')[j].classList.remove('active')
		}
		document.querySelectorAll('.item')[i].classList.add('active')
	})
}

document.querySelector('.back').addEventListener('click', () => {
	document.querySelector('.back').style.display = 'none'
	document.querySelector('.start-page').style.display = 'flex'
	document.querySelector('.course-page').style.display = 'none'
	index = undefined
	document.querySelector('.week1').innerHTML = ''
	document.querySelector('.week2').innerHTML = ''
	document.querySelector('.week3').innerHTML = ''
	document.querySelector('.week4').innerHTML = ''
	document.querySelector('.week5').innerHTML = ''
})

let names = {
	'pr1': '0613-1',
	'pr2': '0613-2',
	'pr3': '0613-3',
	'pr4': '0613-4',
	'tu1': '1015-1',
	'tu2': '1015-2',
	'tu3': '1015-3',
	'ha1': '0411-1',
	'ha2': '0411-2',
	'ha3': '0411-3',
	'gi1': '0721-1',
	'gi2': '0721-2',
	'gi3': '0721-3',
	'pa1': '0214-1',
	'pa2': '0214-2',
	'pa3': '0214-3',
	'xo1': '1013-1',
	'xo2': '1013-2',
	'xo3': '1013-3',
	'xo1t': '1013-1 տեխ',
	'xo2t': '1013-2 տեխ',
	'xo3t': '1013-3 տեխ',
}

let data = {
    "data":[["Երկուշաբթի",null,"0411-1","1015-1","0613-1","1015-2","0421-1","0411-2","0613-2","0613-3","1015-3","0214-1","0214-3","0721-1","0721-2","1013-1","1013-2","1013-1 տեխ","1013-3"],[null,1,"ՆԶՊ  Ա.Ա","Հ.գրականութ  Ս.Է","Հանրահաշիվ Հ.Ս","Գործ.հաղորդակցութ  Խ.Ա","Քաղաքաց. իրավունք Մ.Վ","Հ.լեզվի և խոսքի մշակ հիմ. Ս.Է","Տեքս և գործարար փաստ. Մ.Գ","Ձեռներեցություն  Կ.Ն",null,"Հ.գրակ  Ն.Լ","Ձեռներեցություն Հ.Ս","Խաղողագործություն","Պատմություն Լ.Ն","Գործ.պարապ  Ն.Վ","Ռ.լեզու  Մ.Թ","Կերակ պատ:Աղանդեր  Ն.Ա","Գործնակ պարապ  Ն.Ա"],[null,2,"Հ.գրականութ  Ս.Է","Ռ.լեզու  Մ.Թ","Անգլերեն Հ.Գ","Գործ.հաղորդակցութ  Խ.Ա","Քաղաքաց. իրավունք Մ.Վ","Հ.լեզվի և խոսքի մշակ հիմ. Ս.Է","Տեքս և գործարար փաստ. Մ.Գ","Ձեռներեցություն  Կ.Ն",null,"Անգլերեն  Գ.Ք","Ձեռներեցություն Հ.Ս","Խաղողագործություն","Հանրահաշիվ Հ.Ս","Գործ.պարապ  Ն.Վ","Հ.գրակ  Ն.Լ","Կերակ պատ:Աղանդեր  Ն.Ա","Գործնակ պարապ  Ն.Ա"],[null,3,"Պատմություն Լ.Ն","Անգլերեն Հ.Գ","Ռ.լեզու  Մ.Թ","Գործ.հաղորդակցութ  Խ.Ա","Քաղաք և սոց. հիմ. Ս.Լ","Կառավարում","Ծրագ հիմունքներ  Հ.Ս","Ճան երթևեկ Ա.Ա",null,"Քիմիա      Գ.Ա","Գործ պարապ.   Ս.Բ","Խաղողագործություն","Խաղողագործութ","Անգլերեն  Գ.Ք","Կերակ պատ և ձևավ;Հիմ ուտ  Ն.Վ","Ձեռներեցություն  Հ.Ս","Գործնակ պարապ  Ն.Ա"],[null,4,"Անգլերեն Հ.Գ","Պատմություն Լ.Ն","Ինֆորմատիկա  Ս.Ա","Գործ.հաղորդակցութ  Խ.Ա","Քաղաք և սոց. հիմ. Ս.Լ","Կառավարում","Ծրագ հիմունքներ  Հ.Ս","Ճան երթևեկ Ա.Ա",null,"Ռ.լեզու  Մ.Թ","Գործ պարապ.   Ս.Բ","Խաղողագործություն","Խաղողագործութ","Հ.գրականութ  Մ.Ա","Կերակ պատ և ձևավ;Հիմ ուտ  Ն.Վ","Ձեռներեցություն  Հ.Ս","Գործնակ պարապ  Ն.Ա"],[null,5,"Ռ.լեզու  Մ.Թ","Ինֆորմատիկա  Ս.Ա","Պատմություն Լ.Ն","Քաղաք և սոց. հիմ. Ս.Լ","Քաղաքաց. իրավունք Մ.Վ","Հարկային օրենս.","Տեքս և գործարար փաստ. Մ.Գ","Ռելյաց. տվյալ բազ ծր  Մ.Վ","Ճան երթևեկ Ա.Ա","Հ.լեզու  Ն.Լ","Գործ պարապ.   Ս.Բ","Գործ պարապ.","Խաղողագործութ","Հանրահաշիվ Հ.Ս","Կերակ պատ և ձևավ;Հիմ ուտ  Ն.Վ","ֆիզկուլտուրա   Մ.Մ","Գործնակ պարապ  Ն.Ա"],[null,6,"Ինֆորմատիկա  Ս.Ա","Քիմիա      Գ.Ա","Ֆիզիկա    Գ.Ա","Քաղաք և սոց. հիմ. Ս.Լ","Քաղաքաց. իրավունք Մ.Վ","Հարկային օրենս.","Տեքս և գործարար փաստ. Մ.Գ","Ռելյաց. տվյալ բազ ծր  Մ.Վ","Ճան երթևեկ Ա.Ա","Գործ պարապ.   Ս.Բ","Գործ պարապ.   Ս.Բ","Գործ պարապ.","Խաղողագործութ","Ռ.լեզու  Մ.Թ","Կերակ պատ և ձևավ;Հիմ ուտ  Ն.Վ","ֆիզկուլտուրա   Մ.Մ","Գործնակ պարապ  Ն.Ա"],[null,7,"Քիմիա      Գ.Ա","Հ.լեզու   Ս.Է","Հ.լեզու     Ա.Գ","Կոնֆլիկ. Գ.Հ",null,"ֆիզկուլտուրա   Մ.Մ",null,"Գրաֆիկ.ինտ. Ծրագ.","Զբոս. Փաթեթի ներկ..  Խ.Ա","Գործ պարապ.   Ս.Բ","Գործ պարապ.   Ս.Բ","Գործ պարապ.","Իրավ հիմունք.   Ա.Ն","Հ.լեզու    Մ.Ա","Կերակ պատ և ձևավ:Նախ   Ն.Վ",null,"Ձեռներեցություն  Հ.Ս"],[null,8,"Հ.լեզու   Ս.Է","Ֆիզիկա    Գ.Ա","Հ.գրական.  Ա.Գ","Կոնֆլիկ. Գ.Հ",null,"ֆիզկուլտուրա   Մ.Մ",null,"Գրաֆիկ.ինտ. Ծրագ.","Զբոս. Փաթեթի ներկ..  Խ.Ա",null,"Գործ պարապ.   Ս.Բ","Գործ պարապ.","Իրավ հիմունք.   Ա.Ն",null,"Կերակ պատ և ձևավ:Նախ   Ն.Վ",null,"Ձեռներեցություն  Հ.Ս"],[null,9,null,null,null,null,null,null,null,null,"Զբոս. Փաթեթի ներկ..  Խ.Ա",null,null,null,null,null,null,null,null],[null,10,null,null,null,null,null,null,null,null,"Զբոս. Փաթեթի ներկ..  Խ.Ա",null,null,null,null,null,null,null,null],["Երեքշաբթի",1,"Հանրահաշիվ  Մ.Մ","Պատմություն Լ.Ն","ՆԶՊ  Ա.Ա","Գործ.հաղորդակցութ  Խ.Ա","Քաղաքաց. իրավունք Մ.Վ","Հարկային օրենս.","Ծրագ հիմունքներ  Հ.Ս","Կազմակ. Մար.. Գ.Հ",null,"Ռ.լեզու  Մ.Թ","Միջանցիկ հանովի, խորքապ Ս.Բ","Հ.լեզու  Ն.Լ","Հ.գրականութ  Մ.Ա","Խոհար. Աշ. Նախ.  Ն.Ա","Անգլերեն  Գ.Ք","Պահանջ և հաշվ Ն.Վ",null],[null,2,"Պատմություն Լ.Ն","Հանրահաշիվ  Մ.Մ","Քիմիա      Գ.Ա","Գործ.հաղորդակցութ  Խ.Ա","Քաղաքաց. իրավունք Մ.Վ","Հարկային օրենս.","Ծրագ հիմունքներ  Հ.Ս","Կազմակ. Մար.. Գ.Հ",null,"Հասարակագիտ  Ս.Լ","Միջանցիկ հանովի, խորքապ Ս.Բ","Ռ.լեզու  Մ.Թ","Անգլերեն  Գ.Ք","Խոհար. Աշ. Նախ.  Ն.Ա","Հ.գրակ  Ն.Լ","Պահանջ և հաշվ Ն.Վ",null],[null,3,"Քիմիա      Գ.Ա","Անգլերեն Հ.Գ","Հ.գրականութ.  Ա.Գ","Կոնֆլիկ. Գ.Հ","Քրեական իրավունք Մ.Վ","Հ.լեզվի և խոսքի մշակ հիմ. Ս.Է","Դիֆեր. և ինտեգ հաշ Մ.Մ","Գրաֆիկ.ինտ. Ծրագ.","Զբոս. Փաթեթի ներկ..  Խ.Ա","Պատմություն Լ.Ն","Միջանցիկ հանովի, խորքապ Ս.Բ","Պատմություն Լ.Ն","Հ.լեզու    Մ.Ա","Անգլերեն  Գ.Ք","Ռ.լեզու  Մ.Թ","ՔՊ      Ա.Ա",null],[null,4,"Անգլերեն Հ.Գ","Քիմիա      Գ.Ա","Պատմություն Լ.Ն","Կոնֆլիկ. Գ.Հ","Քրեական իրավունք Մ.Վ","Հ.լեզվի և խոսքի մշակ հիմ. Ս.Է","Դիֆեր. և ինտեգ հաշ Մ.Մ","Գրաֆիկ.ինտ. Ծրագ.","Զբոս. Փաթեթի ներկ..  Խ.Ա","Երկրաչափութ  Մ.Մ","Միջանցիկ հանովի, խորքապ Ս.Բ","Անգլերեն  Գ.Ք","Ռ.լեզու  Մ.Թ","Հ.լեզու    Մ.Ա","Հ.լեզու  Ն.Լ","ՔՊ      Ա.Ա",null],[null,5,"Ռ.լեզու  Մ.Թ","Հ.լեզու   Ս.Է","Հասարակ.   Ա.Ն","Ձեռներեցություն   Գ.Հ","ֆիզկուլտուրա   Մ.Մ","Փաստաթղթ. և հաշ.հաշվ վարում Ս.Հ","Անգլերեն  Գ.Ք","Ռելյաց. տվյալ բազ ծր  Մ.Վ","Զբոս. Փաթեթի ներկ..  Խ.Ա","Հ.լեզու  Ն.Լ","Գործ պարապ.   Ս.Բ","ֆիզկուլտուրա   Մ.Մ","Քիմիա      Գ.Ա","Հասարակ","Գործնակ պարապ  Ն.Ա","Կերակ պատ:Աղանդեր  Ն.Ա","ֆիզկուլտուրա   Մ.Մ"],[null,6,"Հ.լեզու   Ս.Է","Ռ.լեզու  Մ.Թ","Ֆիզիկա    Գ.Ա","Ձեռներեցություն  Գ.Հ","ֆիզկուլտուրա   Մ.Մ","Փաստաթղթ. և հաշ.հաշվ վարում Ս.Հ","Անգլերեն  Գ.Ք","Ռելյաց. տվյալ բազ ծր  Մ.Վ","Զբոս. Փաթեթի ներկ..  Խ.Ա","Հ.գրակ  Ն.Լ","Գործ պարապ.   Ս.Բ","ֆիզկուլտուրա   Մ.Մ","Հանրահաշիվ Հ.Ս","Պատմություն Լ.Ն","Գործնակ պարապ  Ն.Ա","Կերակ պատ:Աղանդեր  Ն.Ա","ֆիզկուլտուրա   Մ.Մ"],[null,7,"Հասարակ.   Ա.Ն","ՆԶՊ  Ա.Ա","Անգլերեն Հ.Գ",null,null,null,null,"Ռելյաց. տվյալ բազ ծր  Մ.Վ","Զբոս. Փաթեթի ներկ..  Խ.Ա","Գործ պարապ.   Ս.Բ","Գործ պարապ.   Ս.Բ",null,null,"Ռ.լեզու  Մ.Թ","Գործնակ պարապ  Ն.Ա","Կերակ պատ:Հիմ ուտ  Ն.Վ","Ձեռներեցություն  Հ.Ս"],[null,8,"Ֆիզիկա    Գ.Ա","Հասարակ.   Ա.Ն","Ռ.լեզու  Մ.Թ",null,null,null,null,"Ռելյաց. տվյալ բազ ծր  Մ.Վ","Զբոս. Փաթեթի ներկ..  Խ.Ա","Գործ պարապ.   Ս.Բ","Գործ պարապ.   Ս.Բ",null,null,"Երկրաչափ Հ.Ս","Գործնակ պարապ  Ն.Ա","Կերակ պատ:Հիմ ուտ  Ն.Վ","Ձեռներեցություն  Հ.Ս"],[null,9,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,"Գործնակ պարապ  Ն.Ա"],[null,10,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,"Գործնակ պարապ  Ն.Ա"],["Չորեքշաբթի",1,"Ռ.լեզու  Մ.Թ","Հանրահաշիվ  Մ.Մ","Հանրահաշիվ Հ.Ս","Ձեռներեցություն","Ուսումնակ պրակտիկ","Լանդշաֆտագիտ և  էկոլոգ հիմ. Գ.Ա","Տեքս և գործարար փաստ. Մ.Գ","Ձեռներեցություն  Կ.Ն","Զբոս. Փաթեթի ներկ..  Խ.Ա","Պատմություն Լ.Ն","Ճան երթևեկ Ա.Ա","Պատմություն Լ.Ն","Հաղորդակց. Մ.Ա","Անգլերեն  Գ.Ք","Կերակ պատ և ձևավ;Հիմ ուտ  Ն.Վ","Կերակ պատ:Աղանդեր  Ն.Ա","Ձեռներեցություն  Հ.Ս"],[null,2,"Հանրահաշիվ  Մ.Մ","Ռ.լեզու  Մ.Թ","Պատմություն Լ.Ն","Ձեռներեցություն","Ուսումնակ պրակտիկ","Լանդշաֆտագիտ և  էկոլոգ հիմ. Գ.Ա","Տեքս և գործարար փաստ. Մ.Գ","Ձեռներեցություն  Կ.Ն","Զբոս. Փաթեթի ներկ..  Խ.Ա","Անգլերեն  Գ.Ք","Ճան երթևեկ Ա.Ա","Երկրաչափ Հ.Ս","Հաղորդակց. Մ.Ա","Հասարակ","Կերակ պատ և ձևավ;Հիմ ուտ  Ն.Վ","Կերակ պատ:Աղանդեր  Ն.Ա","Ձեռներեցություն  Հ.Ս"],[null,3,"Ինֆորմատիկա  Ս.Ա","Պատմություն Լ.Ն","Ռ.լեզու  Մ.Թ","Գործ.հաղորդակցութ  Խ.Ա","Հաղորդակցութ. Մ.Մ","Հաղորդակցութ. Մ.Մ","Դիսկ. մաթ կիրառ. Մ.Մ","Գրաֆիկ.ինտ. Ծրագ.","Ճան երթևեկ Ա.Ա","Հ.գրակ  Ն.Լ","Ձեռներեցություն Հ.Ս","Խաղողագործություն","Անգլերեն  Գ.Ք","Քիմիա","Գործնակ պարապ  Ն.Ա","Անգլերեն Հ.Գ","Գործնակ պարապ  Ն.Ա"],[null,4,"Պատմություն Լ.Ն","Ինֆորմատիկա  Ս.Ա","Քիմիա      Գ.Ա","Գործ.հաղորդակցութ  Խ.Ա","Հաղորդակցութ. Մ.Մ","Հաղորդակցութ. Մ.Մ","Դիսկ. մաթ կիրառ. Մ.Մ","Գրաֆիկ.ինտ. Ծրագ.","Ճան երթևեկ Ա.Ա","Ռ.լեզու  Մ.Թ","Ձեռներեցություն Հ.Ս","Խաղողագործություն","Ֆիզիկա    Գ.Ա","Երկրաչափ Հ.Ս","Գործնակ պարապ  Ն.Ա","Անգլերեն Հ.Գ","Գործնակ պարապ  Ն.Ա"],[null,5,"Հ.գրականութ  Ս.Է","Ֆիզիկա    Գ.Ա","Ինֆորմատիկա  Ս.Ա","Կոնֆլիկ. Գ.Հ","ՔՊ      Ա.Ա","Փաստաթղթ. և հաշ.հաշվ վարում Ս.Հ","Ռ.լեզու  Մ.Թ","Ձեռներեցություն  Կ.Ն","Զբոս. Փաթեթի ներկ..  Խ.Ա","Երկրաչափութ  Մ.Մ","Գործ պարապ.   Ս.Բ","Հ.գրակ  Ն.Լ","Պատմություն Լ.Ն","Հ.գրականութ  Մ.Ա","Անգլերեն  Գ.Ք","Կերակ պատ:Հիմ ուտ  Ն.Վ","Գործնակ պարապ  Ն.Ա"],[null,6,"Ֆիզիկա    Գ.Ա","Հ.գրականութ  Ս.Է","Հ.լեզու     Ա.Գ","Կոնֆլիկ. Գ.Հ","ՔՊ      Ա.Ա","Փաստաթղթ. և հաշ.հաշվ վարում Ս.Հ","Ռ.լեզու  Մ.Թ","Ձեռներեցություն  Կ.Ն","Զբոս. Փաթեթի ներկ..  Խ.Ա","Հանրահաշիվ  Մ.Մ","Գործ պարապ.   Ս.Բ","Անգլերեն  Գ.Ք","Հ.լեզու    Մ.Ա","Պատմություն Լ.Ն","Հանրահաշիվ Հ.Ս","Կերակ պատ:Հիմ ուտ  Ն.Վ","Գործնակ պարապ  Ն.Ա"],[null,7,"ֆիզկուլտուրա   Մ.Մ","ֆիզկուլտուրա   Մ.Մ",null,"ֆիզկուլտուրա   Մ.Մ","Հ.լեզվի և խոսքի մշ հիմ Ա.Գ","Ուսում. պրակտիկա   Հ.Ս","Հաղորդակց. Մ.Ա","Գրաֆիկ.ինտ. Ծրագ.","ֆիզկուլտուրա   Մ.Մ","Գործ պարապ.   Ս.Բ","Գործ պարապ.   Ս.Բ","Ռ.լեզու  Մ.Թ","Երկրաչափ Հ.Ս","Հ.լեզու    Մ.Ա","Կերակ պատ և ձևավ:Նախ   Ն.Վ","Կերակ պատ:Աղանդեր  Ն.Ա",null],[null,8,"ֆիզկուլտուրա   Մ.Մ","ֆիզկուլտուրա   Մ.Մ",null,"ֆիզկուլտուրա   Մ.Մ","Հ.լեզվի և խոսքի մշ հիմ Ա.Գ","Ուսում. պրակտիկա   Հ.Ս","Հաղորդակց. Մ.Ա","Գրաֆիկ.ինտ. Ծրագ.","ֆիզկուլտուրա   Մ.Մ","Գործ պարապ.   Ս.Բ","Գործ պարապ.   Ս.Բ","Քիմիա      Գ.Ա","Ինֆորմատիկա Հ.Ս",null,"Կերակ պատ և ձևավ:Նախ   Ն.Վ","Կերակ պատ:Աղանդեր  Ն.Ա",null],[null,9,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null],[null,10,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null],["Հինգշաբթի",1,"Երկրաչափութ  Մ.Մ","Հ.լեզու   Ս.Է","Ֆիզիկա    Գ.Ա","Ռ.լեզու  Մ.Թ","ՀՀ դատարանակազմ Մ.Վ","Փաստաթղթ. և հաշ.հաշվ վարում Ս.Հ","ԷՀՄ ճարտարապետ  Հ.Ա","Կազմակ. Մար.. Գ.Հ",null,"Պատմություն Լ.Ն","Ճան երթևեկ Ա.Ա","Պատմություն Լ.Ն","Գործնական պարպ","Հանրահաշիվ Հ.Ս","Հ.լեզու  Ն.Լ","Կերակ պատ:Աղանդեր  Ն.Ա","Գործնակ պարապ  Ն.Ա"],[null,2,"Ֆիզիկա    Գ.Ա","Երկրաչափութ  Մ.Մ","Երկրաչափ Հ.Ս","Ռ.լեզու  Մ.Թ","ՀՀ դատարանակազմ Մ.Վ","Փաստաթղթ. և հաշ.հաշվ վարում Ս.Հ","ԷՀՄ ճարտարապետ  Հ.Ա","Կազմակ. Մար.. Գ.Հ",null,"Անգլերեն  Գ.Ք","Ճան երթևեկ Ա.Ա","Հասարակ","Գործնական պարպ","Հ.գրականութ  Մ.Ա","Պատմություն Լ.Ն","Կերակ պատ:Աղանդեր  Ն.Ա","Գործնակ պարապ  Ն.Ա"],[null,3,"Պատմություն Լ.Ն","Ֆիզիկա    Գ.Ա","Հ.գրականութ.  Ա.Գ","Քաղաք և սոցիոլոգ հիմ. Ս.Լ","Ռ.լեզու  Մ.Թ","Կառավարում","Դիֆեր. և ինտեգ հաշ Մ.Մ","Ձեռներեցություն  Կ.Ն","Զբոս. Փաթեթի ներկ..  Խ.Ա","Հ.լեզու  Ն.Լ","Անգլերեն  Գ.Ք","Հանրահաշիվ Հ.Ս","Գործնական պարպ","Քիմիա      Գ.Ա","Անվտանգ.և առ օգ Ա.Ա","Պահանջ և հաշվ Ն.Վ","Գործնակ պարապ  Ն.Ա"],[null,4,"Հ.գրականութ  Ս.Է","Հասարակ.   Ա.Ն","Պատմություն Լ.Ն","Քաղաք և սոցիոլոգ հիմ. Ս.Լ","Ռ.լեզու  Մ.Թ","Կառավարում","Դիֆեր. և ինտեգ հաշ Մ.Մ","Ձեռներեցություն  Կ.Ն","Զբոս. Փաթեթի ներկ..  Խ.Ա","Հ.գրակ  Ն.Լ","Անգլերեն  Գ.Ք","Երկրաչափ Հ.Ս","Գործնական պարպ","Հ.լեզու    Մ.Ա","Անվտանգ.և առ օգ Ա.Ա","Պահանջ և հաշվ Ն.Վ","Գործնակ պարապ  Ն.Ա"],[null,5,"Ռ.լեզու  Մ.Թ","Հ.գրականութ  Ս.Է","Հ.լեզու     Ա.Գ","Կոնֆլիկ. Գ.Հ","Քրեական իրավունք Մ.Վ","Փաստաթղթ. և հաշ.հաշվ վարում Ս.Հ","Դիսկ. մաթ կիրառ. Մ.Մ","ֆիզկուլտուրա   Մ.Մ","Ճան երթևեկ Ա.Ա","Հասարակագիտ  Ս.Լ","ֆիզկուլտուրա   Մ.Մ","Խաղողագործություն","Գործնական պարպ","Պատմություն Լ.Ն","ֆիզկուլտուրա   Մ.Մ","Կերակ պատ:Հիմ ուտ  Ն.Վ","Գործնակ պարապ  Ն.Ա"],[null,6,"Հ.լեզու   Ս.Է","Պատմություն Լ.Ն","Ռ.լեզու  Մ.Թ","Կոնֆլիկ. Գ.Հ","Քրեական իրավունք Մ.Վ","Փաստաթղթ. և հաշ.հաշվ վարում Ս.Հ","Դիսկ. մաթ կիրառ. Մ.Մ","ֆիզկուլտուրա   Մ.Մ","Ճան երթևեկ Ա.Ա","ֆիզկուլտուրա   Մ.Մ","ֆիզկուլտուրա   Մ.Մ","Խաղողագործություն","Գործնական պարպ","Անգլերեն  Գ.Ք","ֆիզկուլտուրա   Մ.Մ","Կերակ պատ:Հիմ ուտ  Ն.Վ","Գործնակ պարապ  Ն.Ա"],[null,7,null,null,"ֆիզկուլտուրա   Մ.Մ","ՔՊ      Ա.Ա","Անգլերեն Հ.Գ",null,"ֆիզկուլտուրա   Մ.Մ",null,"Զբոս. Փաթեթի ներկ..  Խ.Ա","ֆիզկուլտուրա   Մ.Մ",null,"Անգլերեն  Գ.Ք","Գործնական պարպ","Ռ.լեզու  Մ.Թ",null,"Կերակ պատ:Աղանդեր  Ն.Ա","Գործնակ պարապ  Ն.Ա"],[null,8,null,null,"ֆիզկուլտուրա   Մ.Մ","ՔՊ      Ա.Ա","Անգլերեն Հ.Գ",null,"ֆիզկուլտուրա   Մ.Մ",null,"Զբոս. Փաթեթի ներկ..  Խ.Ա",null,null,null,"Գործնական պարպ",null,null,"Կերակ պատ:Աղանդեր  Ն.Ա","Գործնակ պարապ  Ն.Ա"],[null,9,null,null,null,null,null,null,null,null,"Զբոս. Փաթեթի ներկ..  Խ.Ա",null,null,null,null,null,null,null,null],[null,10,null,null,null,null,null,null,null,null,"Զբոս. Փաթեթի ներկ..  Խ.Ա",null,null,null,null,null,null,null,null],["Ուրբաթ",1,"Երկրաչափութ  Մ.Մ","Հ.գրականութ  Ս.Է","Երկրաչափ Հ.Ս","Ձեռներեցություն   Գ.Հ","Քրեական իրավունք Մ.Վ","Անվտանգ.և առ օգ Ա.Ա","ԷՀՄ ճարտարապետ  Հ.Ա","Ռելյաց. տվյալ բազ ծր  Մ.Վ","Զբոս. Փաթեթի ներկ..  Խ.Ա","Ռ.լեզու  Մ.Թ","Միջանցիկ հանովի, խորքապ Ս.Բ","Անգլերեն  Գ.Ք","Լանդշաֆտագիտ և  էկոլոգ հիմ. Գ.Ա","Պատմություն Լ.Ն","Կերակ պատ և ձևավ:Նախ   Ն.Վ","Կերակ պատ:Հիմ ուտ  Ն.Վ","Գործնակ պարապ  Ն.Ա"],[null,2,"Ֆիզիկա    Գ.Ա","Երկրաչափութ  Մ.Մ","Հ.լեզու     Ա.Գ","Ձեռներեցություն   Գ.Հ","Քրեական իրավունք Մ.Վ","Անվտանգ.և առ օգ Ա.Ա","ԷՀՄ ճարտարապետ  Հ.Ա","Ռելյաց. տվյալ բազ ծր  Մ.Վ","Զբոս. Փաթեթի ներկ..  Խ.Ա","Անգլերեն  Գ.Ք","Միջանցիկ հանովի, խորքապ Ս.Բ","Հանրահաշիվ Հ.Ս","Լանդշաֆտագիտ և  էկոլոգ հիմ. Գ.Ա","Ռ.լեզու  Մ.Թ","Կերակ պատ և ձևավ:Նախ   Ն.Վ","Կերակ պատ:Հիմ ուտ  Ն.Վ","Գործնակ պարապ  Ն.Ա"],[null,3,"Հասարակ.   Ա.Ն","Ֆիզիկա    Գ.Ա","Հ.գրականութ.  Ա.Գ","Ուսումնակ պրակտիկ","Քաղաք և սոցիոլոգ հիմ. Ս.Լ","Անգլերեն  Գ.Ք","Դիսկ. մաթ կիրառ. Մ.Մ","Գրաֆիկ.ինտ. Ծրագ.","Զբոս. Փաթեթի ներկ..  Խ.Ա","Պատմություն Լ.Ն","Միջանցիկ հանովի, խորքապ Ս.Բ","Պատմություն Լ.Ն","Ռ.լեզու  Մ.Թ","Խոհար. Աշ. Նախ.  Ն.Ա","Կերակ պատ և ձևավ:Նախ   Ն.Վ","Պահանջ և հաշվ Ն.Վ","Ձեռներեցություն  Հ.Ս"],[null,4,"Հ.գրականութ  Ս.Է","Ռ.լեզու  Մ.Թ","ՆԶՊ  Ա.Ա","Ուսումնակ պրակտիկ","Քաղաք և սոցիոլոգ հիմ. Ս.Լ","Անգլերեն  Գ.Ք","Դիսկ. մաթ կիրառ. Մ.Մ","Գրաֆիկ.ինտ. Ծրագ.","Զբոս. Փաթեթի ներկ..  Խ.Ա","Հ.լեզու  Ն.Լ","Միջանցիկ հանովի, խորքապ Ս.Բ","Քիմիա      Գ.Ա","Հ.գրականութ  Մ.Ա","Խոհար. Աշ. Նախ.  Ն.Ա","Կերակ պատ և ձևավ:Նախ   Ն.Վ","Պահանջ և հաշվ Ն.Վ","Ձեռներեցություն  Հ.Ս"],[null,5,"Հ.լեզու   Ս.Է","ՆԶՊ  Ա.Ա","Ֆիզիկա    Գ.Ա","Անգլերեն  Գ.Ք","ՀՀ դատարանակազմ Մ.Վ","Ռ.լեզու  Մ.Թ","Հաղորդակց. Մ.Ա","Գրաֆիկ.ինտ. Ծրագ.","Զբոս. Փաթեթի ներկ..  Խ.Ա","Հանրահաշիվ  Մ.Մ","Գործ պարապ.   Ս.Բ","Հասարակագիտ  Ս.Լ","ֆիզկուլտուրա   Մ.Մ","Հ.գրականութ  Մ.Ա","Պատմություն Լ.Ն","Ձեռներեցություն  Հ.Ս","Գործնակ պարապ  Ն.Ա"],[null,6,"ՆԶՊ  Ա.Ա","Հ.լեզու   Ս.Է","Հասարակ.   Ա.Ն","Անգլերեն  Գ.Ք","ՀՀ դատարանակազմ Մ.Վ","Ռ.լեզու  Մ.Թ","Հաղորդակց. Մ.Ա","Գրաֆիկ.ինտ. Ծրագ.","Զբոս. Փաթեթի ներկ..  Խ.Ա","Քիմիա      Գ.Ա","Գործ պարապ.   Ս.Բ","Հ.գրակ  Ն.Լ","ֆիզկուլտուրա   Մ.Մ","ֆիզկուլտուրա   Մ.Մ","Հանրահաշիվ Հ.Ս","Ձեռներեցություն  Հ.Ս","Գործնակ պարապ  Ն.Ա"],[null,7,null,null,null,null,"ՀՀ դատարանակազմ Մ.Վ","Տնտեսական  պատմություն Գ.Հ","Լանդ. և  էկոլոգ հիմ. Գ.Ա",null,"Զբոս. Փաթեթի ներկ..  Խ.Ա",null,null,"Հ.լեզու  Ն.Լ",null,"ֆիզկուլտուրա   Մ.Մ",null,null,"Անգլերեն Հ.Գ"],[null,8,null,null,null,null,"ՀՀ դատարանակազմ Մ.Վ","Տնտեսական  պատմություն Գ.Հ","Լանդ. և  էկոլոգ հիմ. Գ.Ա",null,"Զբոս. Փաթեթի ներկ..  Խ.Ա",null,null,null,null,null,null,null,"Անգլերեն Հ.Գ"],[null,9,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null],[null,10,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null],[null,null,"0411-1","1015- 1","0613 -1","1015-2","0421 I","0411-2","0613-2","0613-3","1015III","0214-1","0214-III","0721-I","0721-II","1013-1","1013-II","1013-1 տեխ","1013-III"]]
}


let res = data['data'];
// fetch('/data/data.json')
// 	.then(data => data.json())
// 	.then(data => res = data['data'])
// 	// .then(() => start()) 
// 	.catch(err => console.log(err))



// function start() {
	document.querySelector('.course-btn').addEventListener('click', () => {
		let index;
		if (courseName) {
			// console.log(res[0]);
			for (let i = 0; i < res[0].length; i++) {
				if (res[0][i] === names[courseName]) {
					index = i
					show()
					document.querySelector('.start-page').style.display = 'none'
					document.querySelector('.back').style.display = 'inline-block'
					document.querySelector('.course-page').style.display = 'flex'
					return
				}
			}

		}
		function show() {
			for (let i = 1; i < 11; i++) {
				let newLesson = document.createElement('li')
				newLesson.innerHTML = res[i][index]
				document.querySelector('.week1').appendChild(newLesson)
			}
			for (let i = 11; i < 21; i++) {
				let newLesson = document.createElement('li')
				newLesson.innerHTML = res[i][index]
				document.querySelector('.week2').appendChild(newLesson)
			}
			for (let i = 21; i < 31; i++) {
				let newLesson = document.createElement('li')
				newLesson.innerHTML = res[i][index]
				document.querySelector('.week3').appendChild(newLesson)
			}
			for (let i = 31; i < 41; i++) {
				let newLesson = document.createElement('li')
				newLesson.innerHTML = res[i][index]
				document.querySelector('.week4').appendChild(newLesson)
			}
			for (let i = 41; i < 51; i++) {
				let newLesson = document.createElement('li')
				newLesson.innerHTML = res[i][index]
				document.querySelector('.week5').appendChild(newLesson)
			}
		}
	})

// }
